Revit 2024 API
ParameterTypeId.WallStructuralSignificant Property
 "Structural"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId WallStructuralSignificant { get; }
Visual Basic
Public Shared ReadOnly Property WallStructuralSignificant As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ WallStructuralSignificant {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace